Rolecall_To_Fusion/Rolecall_To_Fusion/Files/RoleCall_FU/Fusion/AccountUpdate/Request - Backup/Request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/">
		<ns1:updateCustomerAccount>
			<ns1:customerAccount xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/">
				<ns2:CustomerAccountId>300000003167502</ns2:CustomerAccountId>
				<ns2:PartyId>300000003167493</ns2:PartyId>
				<ns2:CustomerClassCode>DEFENCE</ns2:CustomerClassCode>
				<ns2:AccountName>Testing_Account1002</ns2:AccountName>
				<ns2:CustAcctInformation xmlns:ns7="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/">
					<ns7:customerGroup>TestingGroup01</ns7:customerGroup>
					<ns7:customerGroupCode>999</ns7:customerGroupCode>
					<ns7:customerGrandParent>TestingParent01</ns7:customerGrandParent>
					<ns7:customerGrandParentCode>999</ns7:customerGrandParentCode>
					<ns7:salesRep>TestSalesRep</ns7:salesRep>
					<ns7:warehouse>1</ns7:warehouse>
					<ns7:marketing>1</ns7:marketing>
				</ns2:CustAcctInformation>
			</ns1:customerAccount>
		</ns1:updateCustomerAccount>
	</soap:Body>
</soap:Envelope>
