DunningLetters/DunningLetters/Files/NS_FU/Fusion/Customer/CreateContact/EditContactAssignmentToSite/Request/CreateContactToSite.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/" xmlns:cus="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/" xmlns:cus1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContactRole/" xmlns:par="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:sour="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/" xmlns:cus2="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContact/" xmlns:cus3="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountRel/" xmlns:cus4="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSiteUse/" xmlns:cus5="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSite/" xmlns:cus6="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:updateCustomerAccount>
			<typ:customerAccount>
				<cus:CustomerAccountId>300000015776295</cus:CustomerAccountId>
				<cus:PartyId>300000015817247</cus:PartyId>
				<cus:CustomerAccountSite>
					<cus:CustomerAccountSiteId>300000015776296</cus:CustomerAccountSiteId>
					<cus:CustomerAccountId>300000015776295</cus:CustomerAccountId>
					<cus:PartySiteId>300000015817248</cus:PartySiteId>
					<cus:CustomerAccountContact>
						<cus:CustomerAccountRoleId>300000015817371</cus:CustomerAccountRoleId>
						<cus:PrimaryFlag>true</cus:PrimaryFlag>
						<cus:CustomerAccountContactRole>
							<cus:ResponsibilityId>300000015817372</cus:ResponsibilityId>
							<cus:ResponsibilityType>BILL_TO</cus:ResponsibilityType>
							<cus:PrimaryFlag>true</cus:PrimaryFlag>
						</cus:CustomerAccountContactRole>
					</cus:CustomerAccountContact>
				</cus:CustomerAccountSite>
			</typ:customerAccount>
		</typ:updateCustomerAccount>
	</soapenv:Body>
</soapenv:Envelope>