DunningLetters/DunningLetters/Files/NS_FU/Fusion/Customer/UpdateAccount/Request/schema.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/">
		<ns1:updateCustomerAccount>
			<ns1:customerAccount xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/">
				<ns2:CustomerAccountId>300000003167502</ns2:CustomerAccountId>
				<ns2:PartyId>300000003167493</ns2:PartyId>
				<ns2:CustomerClassCode>DEFENCE</ns2:CustomerClassCode>
				<ns2:AccountName>Testing_Account1002</ns2:AccountName>
				<ns2:CustAcctInformation xmlns:ns7="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/" xmlns:ns8="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/">
					<ns7:customerGroup>TestingGroup01</ns7:customerGroup>
					<ns7:customerGroupCode>999</ns7:customerGroupCode>
					<ns7:customerGrandParent>TestingParent01</ns7:customerGrandParent>
					<ns7:customerGrandParentCode>999</ns7:customerGrandParentCode>
					<ns7:salesRep ns8:nil="false">TestSalesRep</ns7:salesRep>
					<ns7:warehouse>1</ns7:warehouse>
					<ns7:marketing>1</ns7:marketing>
					<ns7:cinNum>1</ns7:cinNum>
					<ns7:customerProvidedCode>.</ns7:customerProvidedCode>
					<ns7:wthTaxCode>194C - Payment of Co</ns7:wthTaxCode>
					<ns7:defaultTdsRate>2%</ns7:defaultTdsRate>
					<ns7:concessional>Yes</ns7:concessional>
					<ns7:validityPeriod>28/04/2021</ns7:validityPeriod>
					<ns7:thresholdLimit>300000</ns7:thresholdLimit>
					<ns7:virtualAccountNum>.</ns7:virtualAccountNum>
					<ns7:paymentTerms>10 days</ns7:paymentTerms>
					<ns7:suppressReminder>N</ns7:suppressReminder>
					<ns7:suppressStatement>N</ns7:suppressStatement>
					<ns7:acquiredFrom ns8:nil="false"> asdasf
					</ns7:acquiredFrom>
					<ns7:invoiceType>Paper</ns7:invoiceType>
				</ns2:CustAcctInformation>
			</ns1:customerAccount>
		</ns1:updateCustomerAccount>
	</soap:Body>
</soap:Envelope>